<?php
return [
    'name.required' => 'حقل الاسم مطلوب.',
    'name.string'   => 'الاسم يجب أن يكون نصًا صحيحًا.',
    'name.min'      => 'الاسم يجب ألا يقل عن 3 أحرف.',
    'name.max'      => 'الاسم يجب ألا يزيد عن 255 حرفًا.',

    'email.required' => 'حقل البريد الإلكتروني مطلوب.',
    'email.email'    => 'البريد الإلكتروني غير صالح.',
    'email.used'     => "هذا البريد الالكتروني مستخدم من قبل لا يمكنك استخدامة",

    'phone.required' => 'حقل رقم الهاتف مطلوب.',
    'phone.digits'   => 'رقم الهاتف يجب أن يتكون من 11 رقمًا.',
    'phone.exists'   => 'رقم الهاتف غير موجود لدينا.',
    'phone.used'     => 'هذا الرقم مستخدم من قبل لا يمكنك استخدامة ',

    'password.required' => 'حقل كلمة المرور مطلوب.',
    'password.string'   => 'كلمة المرور يجب أن تكون نصًا صحيحًا.',
    'password.min'      => 'كلمة المرور يجب ألا تقل عن 6 أحرف.',
    'password.max'      => 'كلمة المرور يجب ألا تزيد عن 255 حرفًا.',
];
